Revit 2026 API

# ElectricalSystemTrueCurrentPhaseB Property

---

The TrueCurrentPhaseB value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TrueCurrentPhaseB { get; }
```
```vb
Public ReadOnly Property TrueCurrentPhaseB As Double
	Get
```
```cpp
public:
property double TrueCurrentPhaseB {
	double get ();
}
```
```fsharp
member TrueCurrentPhaseB : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the TrueCurrentPhaseB value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace